Repository: LilConsul/hell-app
Catalog: src/backend/app/i18n/translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Hello World
pl: Witaj Świecie

source: Users retrieved successfully
pl: Użytkownicy pobrani pomyślnie

source: User role changed successfully
pl: Rola użytkownika zmieniona pomyślnie

source: User deleted successfully
pl: Użytkownik usunięty pomyślnie

source: User verified successfully
pl: Użytkownik zweryfikowany pomyślnie

source: User not found
pl: Nie znaleziono użytkownika

source: Not authenticated
pl: Nie uwierzytelniono

source: Invalid token
pl: Nieprawidłowy token

source: Only students can access this resource
pl: Tylko studenci mają dostęp do tego zasobu

source: Only teachers can access this resource
pl: Tylko nauczyciele mają dostęp do tego zasobu

source: Only admins can access this resource
pl: Tylko administratorzy mają dostęp do tego zasobu

source: User registered successfully. Please verify your email.
pl: Użytkownik zarejestrowany pomyślnie. Proszę zweryfikować adres email.

source: Login successful
pl: Logowanie pomyślne

source: Logout successful
pl: Wylogowanie pomyślne

source: Email verified successfully
pl: Adres email zweryfikowany pomyślnie

source: Password reset email sent. Please check your inbox.
pl: Email z resetowaniem hasła wysłany. Sprawdź swoją skrzynkę odbiorczą.

source: Password reset successfully
pl: Hasło zresetowane pomyślnie

source: Google login successful
pl: Logowanie przez Google pomyślne

source: User with email {email} already exists
pl: Użytkownik z adresem email {email} już istnieje

source: Invalid username or password
pl: Nieprawidłowa nazwa użytkownika lub hasło

source: Email not verified. Please verify your email first.
pl: Email nie zweryfikowany. Proszę najpierw zweryfikować swój adres email.

source: Invalid or expired verification token
pl: Nieprawidłowy lub wygasły token weryfikacyjny

source: Invalid token type
pl: Nieprawidłowy typ tokenu

source: User is already verified
pl: Użytkownik jest już zweryfikowany

source: No user found with email {email}
pl: Nie znaleziono użytkownika z adresem email {email}

source: Invalid or expired password reset token
pl: Nieprawidłowy lub wygasły token resetowania hasła

source: Exams retrieved successfully
pl: Egzaminy pobrane pomyślnie

source: Exam retrieved successfully
pl: Egzamin pobrany pomyślnie

source: Attempt retrieved successfully
pl: Próba pobrana pomyślnie

source: Exam started successfully
pl: Egzamin rozpoczęty pomyślnie

source: Answer saved successfully
pl: Odpowiedź zapisana pomyślnie

source: Question flagged successfully
pl: Pytanie oznaczone flagą pomyślnie

source: Exam reloaded successfully
pl: Egzamin przeładowany pomyślnie

source: Exam submitted successfully
pl: Egzamin przesłany pomyślnie

source: Exam not found
pl: Nie znaleziono egzaminu

source: You do not have permission to access this exam
pl: Nie masz uprawnień do dostępu do tego egzaminu

source: Attempt not found
pl: Nie znaleziono próby

source: You do not have permission to access this attempt
pl: Nie masz uprawnień do dostępu do tej próby

source: Attempt is still in progress
pl: Próba jest wciąż w toku

source: Exam is not available yet
pl: Egzamin nie jest jeszcze dostępny

source: Exam has already ended
pl: Egzamin już się zakończył

source: Exam already started
pl: Egzamin już się rozpoczął

source: Max attempts reached
pl: Osiągnięto maksymalną liczbę prób

source: Exam not in progress
pl: Egzamin nie jest w toku

source: No active attempt found
pl: Nie znaleziono aktywnej próby

source: Attempt is not in progress
pl: Próba nie jest w toku

source: Question not found in this attempt
pl: Nie znaleziono pytania w tej próbie

source: Multiple choice question requires option selections
pl: Pytanie wielokrotnego wyboru wymaga zaznaczenia opcji

source: Single choice question requires exactly one option
pl: Pytanie jednokrotnego wyboru wymaga dokładnie jednej opcji

source: Short answer question requires text input
pl: Pytanie z krótką odpowiedzią wymaga wprowadzenia tekstu

source: No responses found for this attempt
pl: Nie znaleziono odpowiedzi dla tej próby

source: No questions found for this attempt
pl: Nie znaleziono pytań dla tej próby

source: Collection created successfully
pl: Kolekcja utworzona pomyślnie

source: Collections retrieved successfully
pl: Kolekcje pobrane pomyślnie

source: Public collections retrieved successfully
pl: Publiczne kolekcje pobrane pomyślnie

source: Collection retrieved successfully
pl: Kolekcja pobrana pomyślnie

source: Collection updated successfully
pl: Kolekcja zaktualizowana pomyślnie

source: Collection deleted successfully
pl: Kolekcja usunięta pomyślnie

source: Question added successfully
pl: Pytanie dodane pomyślnie

source: Questions reordered successfully
pl: Pytania przearanżowane pomyślnie

source: Question updated successfully
pl: Pytanie zaktualizowane pomyślnie

source: Question deleted successfully
pl: Pytanie usunięte pomyślnie

source: Exam instances retrieved successfully
pl: Instancje egzaminu pobrane pomyślnie

source: Exam instance created successfully
pl: Instancja egzaminu utworzona pomyślnie

source: Exam instance retrieved successfully
pl: Instancja egzaminu pobrana pomyślnie

source: Exam instance updated successfully
pl: Instancja egzaminu zaktualizowana pomyślnie

source: Exam instance deleted successfully
pl: Instancja egzaminu usunięta pomyślnie

source: Exam report retrieved successfully
pl: Raport egzaminu pobrany pomyślnie

source: Collection not found
pl: Nie znaleziono kolekcji

source: You don't have access to this collection
pl: Nie masz dostępu do tej kolekcji

source: You do not own this collection
pl: Nie jesteś właścicielem tej kolekcji

source: Question type is required
pl: Typ pytania jest wymagany

source: {question_type} question must have options
pl: Pytanie typu {question_type} musi mieć opcje

source: {question_type} question must have at least one correct answer
pl: Pytanie typu {question_type} musi mieć co najmniej jedną poprawną odpowiedź

source: {QuestionType} question must have exactly one correct answer
pl: Pytanie typu {QuestionType} musi mieć dokładnie jedną poprawną odpowiedź

source: {QuestionType} question must have a correct_input_answer
pl: Pytanie typu {QuestionType} musi mieć correct_input_answer

source: Collection with ID {collection_id} not found
pl: Nie znaleziono kolekcji o ID {collection_id}

source: You don't have permission to add questions to this collection
pl: Nie masz uprawnień do dodawania pytań do tej kolekcji

source: Question with position {question_data} already exists in the collection
pl: Pytanie na pozycji {question_data} już istnieje w kolekcji

source: Question not found
pl: Nie znaleziono pytania

source: You do not own this question
pl: Nie jesteś właścicielem tego pytania

source: Question ID {question_id} does not exist in the collection
pl: Identyfikator pytania {question_id} nie istnieje w kolekcji

source: Position cannot be negative for question {question_id}
pl: Pozycja nie może być ujemna dla pytania {question_id}

source: Duplicate position {position} found. Positions must be unique
pl: Znaleziono duplikat pozycji {position}. Pozycje muszą być unikalne

source: Position {position} is already used by another question
pl: Pozycja {position} jest już używana przez inne pytanie

source: Exam instance not found
pl: Nie znaleziono instancji egzaminu

source: You don't have access to this exam instance
pl: Nie masz dostępu do tej instancji egzaminu

source: Start date must be in the future
pl: Data rozpoczęcia musi być w przyszłości

source: End date must be after start date
pl: Data zakończenia musi być po dacie rozpoczęcia

source: Student with ID {} not found
pl: Nie znaleziono studenta o ID {}

source: You do not have access to this collection
pl: Nie masz dostępu do tej kolekcji

source: Collection does not contain any questions. Please add questions to the collection before creating an exam instance.
pl: Kolekcja nie zawiera żadnych pytań. Dodaj pytania do kolekcji przed utworzeniem instancji egzaminu.

source: You do not own this exam instance
pl: Nie jesteś właścicielem tej instancji egzaminu

source: User info retrieved successfully
pl: Informacje o użytkowniku pobrane pomyślnie

source: User info updated successfully
pl: Informacje o użytkowniku zaktualizowane pomyślnie

source: User deletion requested successfully
pl: Żądanie usunięcia użytkownika wysłane pomyślnie

source: Password changed successfully
pl: Hasło zmienione pomyślnie

source: Students retrieved successfully
pl: Studenci pobrani pomyślnie

source: Invalid or expired token
pl: Nieprawidłowy lub wygasły token

source: Token does not match current user
pl: Token nie pasuje do bieżącego użytkownika

source: Invalid password
pl: Nieprawidłowe hasło
