Repository: LilConsul/hell-app
Catalog: backend/app/i18n/translations/*/LC_MESSAGES/messages.po
Languages: uk_ua

source: Hello World
uk_ua: Привіт Світ

source: Users retrieved successfully
uk_ua: Користувачів успішно отримано

source: User role changed successfully
uk_ua: Роль користувача успішно змінено

source: User deleted successfully
uk_ua: Користувача успішно видалено

source: User verified successfully
uk_ua: Користувача успішно верифіковано

source: User not found
uk_ua: Користувача не знайдено

source: Not authenticated
uk_ua: Не автентифіковано

source: Invalid token
uk_ua: Недійсний токен

source: Only students can access this resource
uk_ua: Лише студенти мають доступ до цього ресурсу

source: Only teachers can access this resource
uk_ua: Лише викладачі мають доступ до цього ресурсу

source: Only admins can access this resource
uk_ua: Лише адміністратори мають доступ до цього ресурсу

source: User registered successfully. Please verify your email.
uk_ua: Користувача успішно зареєстровано. Будь ласка, підтвердіть вашу електронну пошту.

source: Login successful
uk_ua: Вхід успішний

source: Logout successful
uk_ua: Вихід успішний

source: Email verified successfully
uk_ua: Електронну пошту успішно підтверджено

source: Password reset email sent. Please check your inbox.
uk_ua: Електронний лист для скидання пароля надіслано. Будь ласка, перевірте вашу поштову скриньку.

source: Password reset successfully
uk_ua: Пароль успішно скинуто

source: Google login successful
uk_ua: Вхід через Google успішний

source: User with email {email} already exists
uk_ua: Користувач з електронною поштою {email} вже існує

source: Invalid username or password
uk_ua: Недійсне ім'я користувача або пароль

source: Email not verified. Please verify your email first.
uk_ua: Електронну пошту не підтверджено. Будь ласка, спочатку підтвердіть вашу електронну пошту.

source: Invalid or expired verification token
uk_ua: Недійсний або прострочений токен верифікації

source: Invalid token type
uk_ua: Недійсний тип токена

source: User is already verified
uk_ua: Користувача вже верифіковано

source: No user found with email {email}
uk_ua: Не знайдено користувача з електронною поштою {email}

source: Invalid or expired password reset token
uk_ua: Недійсний або прострочений токен для скидання пароля

source: Exams retrieved successfully
uk_ua: Іспити успішно отримано

source: Exam retrieved successfully
uk_ua: Іспит успішно отримано

source: Attempt retrieved successfully
uk_ua: Спробу успішно отримано

source: Exam started successfully
uk_ua: Іспит успішно розпочато

source: Answer saved successfully
uk_ua: Відповідь успішно збережено

source: Question flagged successfully
uk_ua: Питання успішно позначено

source: Exam reloaded successfully
uk_ua: Іспит успішно перезавантажено

source: Exam submitted successfully
uk_ua: Іспит успішно подано

source: Exam not found
uk_ua: Іспит не знайдено

source: You do not have permission to access this exam
uk_ua: У вас немає дозволу на доступ до цього іспиту

source: Attempt not found
uk_ua: Спробу не знайдено

source: You do not have permission to access this attempt
uk_ua: У вас немає дозволу на доступ до цієї спроби

source: Attempt is still in progress
uk_ua: Спроба все ще триває

source: Exam is not available yet
uk_ua: Іспит ще не доступний

source: Exam has already ended
uk_ua: Іспит вже закінчився

source: Exam already started
uk_ua: Іспит вже розпочато

source: Max attempts reached
uk_ua: Досягнуто максимальної кількості спроб

source: Exam not in progress
uk_ua: Іспит не в процесі

source: No active attempt found
uk_ua: Не знайдено активної спроби

source: Attempt is not in progress
uk_ua: Спроба не в процесі

source: Question not found in this attempt
uk_ua: Питання не знайдено в цій спробі

source: Multiple choice question requires option selections
uk_ua: Питання з множинним вибором вимагає вибору варіантів

source: Single choice question requires exactly one option
uk_ua: Питання з одиночним вибором вимагає вибору рівно одного варіанту

source: Short answer question requires text input
uk_ua: Питання з короткою відповіддю вимагає введення тексту

source: No responses found for this attempt
uk_ua: Не знайдено відповідей для цієї спроби

source: No questions found for this attempt
uk_ua: Не знайдено питань для цієї спроби

source: Collection created successfully
uk_ua: Колекцію успішно створено

source: Collections retrieved successfully
uk_ua: Колекції успішно отримано

source: Public collections retrieved successfully
uk_ua: Публічні колекції успішно отримано

source: Collection retrieved successfully
uk_ua: Колекцію успішно отримано

source: Collection updated successfully
uk_ua: Колекцію успішно оновлено

source: Collection deleted successfully
uk_ua: Колекцію успішно видалено

source: Question added successfully
uk_ua: Питання успішно додано

source: Questions reordered successfully
uk_ua: Питання успішно переупорядковано

source: Question updated successfully
uk_ua: Питання успішно оновлено

source: Question deleted successfully
uk_ua: Питання успішно видалено

source: Exam instances retrieved successfully
uk_ua: Екземпляри іспиту успішно отримано

source: Exam instance created successfully
uk_ua: Екземпляр іспиту успішно створено

source: Exam instance retrieved successfully
uk_ua: Екземпляр іспиту успішно отримано

source: Exam instance updated successfully
uk_ua: Екземпляр іспиту успішно оновлено

source: Exam instance deleted successfully
uk_ua: Екземпляр іспиту успішно видалено

source: Exam report retrieved successfully
uk_ua: Звіт про іспит успішно отримано

source: Collection not found
uk_ua: Колекцію не знайдено

source: You don't have access to this collection
uk_ua: У вас немає доступу до цієї колекції

source: You do not own this collection
uk_ua: Ви не є власником цієї колекції

source: Question type is required
uk_ua: Тип питання є обов'язковим

source: {question_type} question must have options
uk_ua: Питання типу {question_type} повинно мати варіанти

source: {question_type} question must have at least one correct answer
uk_ua: Питання типу {question_type} повинно мати принаймні одну правильну відповідь

source: {QuestionType} question must have exactly one correct answer
uk_ua: Питання типу {QuestionType} повинно мати рівно одну правильну відповідь

source: {QuestionType} question must have a correct_input_answer
uk_ua: Питання типу {QuestionType} повинно мати correct_input_answer

source: Collection with ID {collection_id} not found
uk_ua: Колекцію з ідентифікатором {collection_id} не знайдено

source: You don't have permission to add questions to this collection
uk_ua: У вас немає дозволу додавати питання до цієї колекції

source: Question with position {question_data} already exists in the collection
uk_ua: Питання з позицією {question_data} вже існує в колекції

source: Question not found
uk_ua: Питання не знайдено

source: You do not own this question
uk_ua: Ви не є власником цього питання

source: Question ID {question_id} does not exist in the collection
uk_ua: Ідентифікатор питання {question_id} не існує в колекції

source: Position cannot be negative for question {question_id}
uk_ua: Позиція не може бути від'ємною для питання {question_id}

source: Duplicate position {position} found. Positions must be unique
uk_ua: Знайдено дублікат позиції {position}. Позиції повинні бути унікальними

source: Position {position} is already used by another question
uk_ua: Позиція {position} вже використовується іншим питанням

source: Exam instance not found
uk_ua: Екземпляр іспиту не знайдено

source: You don't have access to this exam instance
uk_ua: У вас немає доступу до цього екземпляру іспиту

source: Start date must be in the future
uk_ua: Дата початку повинна бути в майбутньому

source: End date must be after start date
uk_ua: Дата завершення повинна бути після дати початку

source: Student with ID {} not found
uk_ua: Студента з ідентифікатором {} не знайдено

source: You do not have access to this collection
uk_ua: У вас немає доступу до цієї колекції

source: Collection does not contain any questions. Please add questions to the collection before creating an exam instance.
uk_ua: Колекція не містить жодних питань. Будь ласка, додайте питання до колекції перед створенням екземпляру іспиту.

source: You do not own this exam instance
uk_ua: Ви не є власником цього екземпляру іспиту

source: User info retrieved successfully
uk_ua: Інформацію про користувача успішно отримано

source: User info updated successfully
uk_ua: Інформацію про користувача успішно оновлено

source: User deletion requested successfully
uk_ua: Запит на видалення користувача успішно надіслано

source: Password changed successfully
uk_ua: Пароль успішно змінено

source: Students retrieved successfully
uk_ua: Студентів успішно отримано

source: Invalid or expired token
uk_ua: Недійсний або прострочений токен

source: Token does not match current user
uk_ua: Токен не відповідає поточному користувачеві

source: Invalid password
uk_ua: Недійсний пароль
